nc: 1
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]      # P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]     # P2/4
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, Conv, [256, 3, 2]]          # P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, MambaBlock2D, [16, 2]]      # d_state=16, expand=2

  - [-1, 1, Conv, [512, 3, 2]]          # P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, MambaBlock2D, [16, 2]]

  - [-1, 1, Conv, [1024, 3, 2]]         # P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SCCA, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, SCCA, []]
  - [-1, 1, ADDR, []]   # New: placed in P3 high-res branch to improve small object recall and boundary stability

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [1024, True]]

  - [[20, 23, 26], 1, Segment, [nc, 32, 256]]  # Originally [19, 22, 25]
